#십진수 25 를 이진수로 바꾸어보라.
number1 = 25
print("{:#b}".format(number1))
# 실제 문제는 25를 손으로 계산하여 이진수로 만들기

#이진수 0b1011_0011_0100_1001 을 16진수로 바꾸어보세요
number2 = 0b1011_0011_0100_1001
print("{:#x}".format(number2))

#& 연산자를 사용하여 6과 5를 비트 AND 연산을 해보고 그 결과가 왜 그렇게 나왔는지 설명해보세요.
print("{}".format(6&5))
print("  6={:#b}, \n  5={:#b}, \n6&5={:#b}".format(6,5,6&5))

#변수 reg 에 0에서 63 사이의 값이 저장되어 있다. 세번째 자리수의 비트가 1인지 어떻게 알수 있을까요? 말로 풀어서 써보세요. (?????1??)
reg = int(input("0에서 63사이의 값을 입력하세요 : "))
print((0b100&reg)==0b100)
